cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF50xN.xml
        <!-- REGISTER "WDG_CTL" -->
        <register>
          <name>WDG_CTL</name>
          <description>Hardware Watchdog Timer Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RESEN" -->
            <field>
              <name>RESEN</name>
              <description>Hardware watchdog reset enable bit</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTEN" -->
            <field>
              <name>INTEN</name>
              <description>Hardware watchdog interrupt and counter enable bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WDG_ICL" -->
        <register>
          <name>WDG_ICL</name>
          <description>Hardware Watchdog Timer Clear Register</description>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0x00</resetMask>
        </register>
        <!-- REGISTER "WDG_RIS" -->
        <register>
          <name>WDG_RIS</name>
          <description>Hardware Watchdog Timer Interrupt Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0x00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RIS" -->
            <field>
              <name>RIS</name>
              <description>Hardware watchdog interrupt status bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WDG_LCK" -->
        <register>
          <name>WDG_LCK</name>
          <description>Hardware Watchdog Timer Lock Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DTIM" -->
    <peripheral>
      <name>DTIM</name>
      <description>Dual Timer</description>
      <groupName>DTIM</groupName>
      <baseAddress>0x40015000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "DTIM_QDU" -->
      <interrupt>
        <name>DTIM_QDU</name>
        <value>6</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "TIMER1LOAD" -->
        <register>
          <name>TIMER1LOAD</name>
          <description>Load Register</description>
          <alternateGroup>DualTimer1</alternateGroup>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TIMER1VALUE" -->
        <register>
          <name>TIMER1VALUE</name>
          <description>Value Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TIMER1CONTROL" -->
        <register>
          <name>TIMER1CONTROL</name>
          <description>Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000000EF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TimerEn" -->
            <field>
              <name>TimerEn</name>
              <description>Enable bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TimerMode" -->
            <field>
              <name>TimerMode</name>
              <description>Mode bit </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IntEnable" -->
            <field>
              <name>IntEnable</name>
              <description>Interrupt enable bit</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TimerPre" -->
            <field>
              <name>TimerPre</name>
              <description>Prescale bits</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TimerSize" -->
            <field>
              <name>TimerSize</name>
              <description>Counter size bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OneShot" -->
            <field>
              <name>OneShot</name>
              <description>One-shot mode bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
