cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF50xN.xml
        <!-- REGISTER "RT_TMR" -->
        <register>
          <name>RT_TMR</name>
          <description>Timer Register</description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0000</resetMask>
        </register>
        <!-- REGISTER "PWC_TMCR" -->
        <register>
          <name>PWC_TMCR</name>
          <description>Timer Control Register</description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x77F6</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS2_0" -->
            <field>
              <name>CKS2_0</name>
              <description>Count clock selection bit </description>
              <lsb>12</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EGS" -->
            <field>
              <name>EGS</name>
              <description>Measurement edge selection bits </description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "T32" -->
            <field>
              <name>T32</name>
              <description>32-bit timer selection bit </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FMD" -->
            <field>
              <name>FMD</name>
              <description>Timer function selection bits </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDSE" -->
            <field>
              <name>MDSE</name>
              <description>Mode selection bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTEN" -->
            <field>
              <name>CTEN</name>
              <description>Timer enable bit </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWC_TMCR2" -->
        <register>
          <name>PWC_TMCR2</name>
          <description>Timer Control Register 2</description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS3" -->
            <field>
              <name>CKS3</name>
              <description>Count clock selection bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWC_STC" -->
        <register>
          <name>PWC_STC</name>
          <description>Status Control Register</description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xD5</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERR" -->
            <field>
              <name>ERR</name>
              <description>Error flag bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EDIE" -->
            <field>
              <name>EDIE</name>
              <description>Measurement completion interrupt request enable bit </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVIE" -->
            <field>
              <name>OVIE</name>
              <description>Overflow interrupt request enable bit </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDIR" -->
            <field>
              <name>EDIR</name>
              <description>Measurement completion interrupt request bit </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OVIR" -->
            <field>
              <name>OVIR</name>
              <description>Overflow interrupt request bit </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWC_DTBF" -->
        <register>
          <name>PWC_DTBF</name>
          <description>Data Buffer Register</description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BT1" -->
    <peripheral derivedFrom="BT0">
      <name>BT1</name>
      <baseAddress>0x40025040</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "BT2" -->
    <peripheral derivedFrom="BT0">
      <name>BT2</name>
      <baseAddress>0x40025080</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "BT3" -->
    <peripheral derivedFrom="BT0">
      <name>BT3</name>
      <baseAddress>0x400250C0</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "BT4" -->
    <peripheral derivedFrom="BT0">
      <name>BT4</name>
      <baseAddress>0x40025200</baseAddress>
    </peripheral>
